## Sweetviz

### Importamos nuestras librerias

In [12]:
import pandas as pd
import sweetviz as sv

### Cargamos y preparamos nuestros datos

In [7]:
df_train = pd.read_csv('./Data/titanic_train.csv')
df_test = pd.read_csv('./Data/titanic_test.csv')

In [9]:
df_train.sample(5)

,PassengerId,Sex,Age,Name,Survived,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,male,19.00,"Fortune, Mr. Charles Alexander",0,1,3,2,19950,263.0000,C23 C25 C27,S
60,61,male,22.00,"Sirayanian, Mr. Orsen",0,3,0,0,2669,7.2292,NaN,C
512,513,male,36.00,"McGough, Mr. James Robert",1,1,0,0,PC 17473,26.2875,E25,S
545,546,male,64.00,"Nicholson, Mr. Arthur Ernest",0,1,0,0,693,26.0000,NaN,S
78,79,male,0.83,"Caldwell, Master. Alden Gates",1,2,0,2,248738,29.0000,NaN,S

In [10]:
df_test.sample(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
340,1232,2,"Fillbrook, Mr. Joseph Charles",male,18.0,0,0,C.A. 15185,10.500,NaN,S
55,947,3,"Rice, Master. Albert",male,10.0,4,1,382652,29.125,NaN,Q
180,1072,2,"McCrie, Mr. James Matthew",male,30.0,0,0,233478,13.000,NaN,S
65,957,2,"Corey, Mrs. Percy C (Mary Phyllis Elizabeth Mi...",female,NaN,0,0,F.C.C. 13534,21.000,NaN,S
345,1237,3,"Abelseth, Miss. Karen Marie",female,16.0,0,0,348125,7.650,NaN,S

In [17]:
my_report_comp= sv.compare([df_train, "Train"], [df_test, "Test"], "Survived")

HBox(children=(HTML(value=''), FloatProgress(value=0.0, layout=Layout(flex='2'), max=13.0), HTML(value='')), lâ€¦

In [18]:
my_report_comp.show_html("Reporte_comp.html")

Report Reporte_comp.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.